views/residential-property/_search.php

<div class="pro_left_column">
    <div class="row">
<?php
$bhkModels = Bhk::find()->where(['status'=>1])->orderBy(["name" => "asc"])->all();?>
---
SELECT * FROM `tbl_bhk` WHERE `status`=1 ORDER BY `name`